Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.SymtemColorFillLegendNotAllowed
[Category name] Color Fill Legend can only be placed in a Floor Plan View.

Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures.OnlyOneColorFillNonPlan
A Color Fill Legend can only be placed in a Floor Plan View or a Section View.

Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures
Failures about ColorFill.